In [2]:
import pandas as pd

In [13]:
data_emp = {
    'id':[1,2,3,4,5],
    'emp_name':['Vasya', 'Vasya', 'Petya', 'Igor', 'Nikita'],
    'rating':[5,3,9,4,2]
}

data_tasks = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
    'assignee_id': [1, 1, 2, 5, 5, 4, 5, 5, 5, 5, 2, 3, 3, 2, 3, 5, 2],
    'rating': [5, 4, 2, 5, 1, 7, 9, 3, 3, 5, 7, 8, 8, 7, 9, 4, 5]
}

In [15]:
df_tasks = pd.DataFrame(data_tasks)
df_tasks.head()

   id  assignee_id  rating
0   1            1       5
1   2            1       4
2   3            2       2
3   4            5       5
4   5            5       1

In [16]:
df_emp = pd.DataFrame(data_emp)
df_emp.head()

   id emp_name  rating
0   1    Vasya       5
1   2    Vasya       3
2   3    Petya       9
3   4     Igor       4
4   5   Nikita       2

In [19]:
merge_data = df_tasks.merge(df_emp,left_on='assignee_id', right_on='id')
merge_data

    id_x  assignee_id  rating_x  id_y emp_name  rating_y
0      1            1         5     1    Vasya         5
1      2            1         4     1    Vasya         5
2      3            2         2     2    Vasya         3
3      4            5         5     5   Nikita         2
4      5            5         1     5   Nikita         2
5      6            4         7     4     Igor         4
6      7            5         9     5   Nikita         2
7      8            5         3     5   Nikita         2
8      9            5         3     5   Nikita         2
9     10            5         5     5   Nikita         2
10    11            2         7     2    Vasya         3
11    12            3         8     3    Petya         9
12    13            3         8     3    Petya         9
13    14            2         7     2    Vasya         3
14    15            3         9     3    Petya         9
15    16            5         4     5   Nikita         2
16    17            2         5     2    Vasya         3

In [51]:
result = merge_data.groupby(['emp_name', 'id_y']).count()

In [52]:
result = result[result['id_x'] < 3]
result

               id_x  assignee_id  rating_x  rating_y
emp_name id_y
Igor     4        1            1         1         1
Vasya    1        2            2         2         2

In [53]:
result = result.reset_index()[['emp_name', 'id_x']]
result

  emp_name  id_x
0     Igor     1
1    Vasya     2

In [55]:
result =result.rename(columns={'id_x': 'count_tasks'}).sort_values(by='count_tasks',ascending=False)
result

  emp_name  count_tasks
1    Vasya            2
0     Igor            1